<?php

class form
{
    /**
     * Генерація HTML форми <form>.
     *
     * Ця функція дозволяє створити форму з можливістю налаштування різних параметрів, таких як метод, дія, класи, а також додаванням полів для вводу.
     * За допомогою цієї функції можна швидко створювати форми для збору даних користувача.
     *
     * @param string $action Дія форми, тобто URL, куди будуть відправлені дані.
     * @param string $method Метод передачі даних форми. Може бути 'GET' або 'POST'. За замовчуванням 'POST'.
     * @param string|null $form_class Клас для стилізації форми. За замовчуванням null (без класу).
     * @param bool $enctype Визначає тип кодування, який використовується для форми. Це необхідно для відправки файлів. За замовчуванням false.
     * @param string $target Визначає, де відображатиметься відповідь на форму. Наприклад, '_self', '_blank'. За замовчуванням '_self'.
     *
     * @return void
     */

    /**
     * Закриття HTML форми.
     *
     * Ця функція закриває тег <form>.
     *
     * @return void
     */

    public static function close(): void {
        echo '</form>';
    }
}
